/********************************************************************************************************* 
** 													
**                                    中国软件开源组织 							
**														
**                                   嵌入式实时操作系统							
**														
**                                       SmileOS(TM)							
**														
**                               Copyright  All Rights Reserved						
**														
**--------------文件信息--------------------------------------------------------------------------------	
**														
** 文   件   名: symbol.c											
**														
** 创   建   人: MakeSymbol 工具										
**														
** 文件创建日期: 2013 年 02 月 04 日						
**														
** 描        述: SmileOS 操作系统符号表. (此文件由 MakeSymbol 工具自动生成, 请勿修改)			
*********************************************************************************************************/	
#include "kern/func_config.h"                                          
#if CONFIG_MODULE_EN 
#include "module/symbol_tool.h"										
														
#define SYMBOL_TABLE_BEGIN symbol_t symbol_tbl[] = { 						
  														
#define SYMBOL_TABLE_END   {0, 0, 0} };									
SYMBOL_TABLE_BEGIN												
SYMBOL_TABLE_END												
#endif                                               
/*********************************************************************************************************	
** END FILE													
*********************************************************************************************************/	
